test-resources/server/validation/MsgNo1Correct.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
   <soapenv:Header>
      <wsrm:Sequence soapenv:mustUnderstand="1" xmlns:wsrm="http://schemas.xmlsoap.org/ws/2005/02/rm">
         <wsrm:Identifier>uuid:1103f940-c075-11d9-bcf8-d4be11fd17cb</wsrm:Identifier>
         <wsrm:MessageNumber>1</wsrm:MessageNumber>
      </wsrm:Sequence>
      <wsa:MessageID soapenv:mustUnderstand="1">uuid:101bbc20-c075-11d9-b48b-ec4b63ffde41</wsa:MessageID>
      <wsa:To soapenv:mustUnderstand="1">http://127.0.0.1:8070/axis/services/RMTestService?wsdl</wsa:To>
      <wsa:Action soapenv:mustUnderstand="1">urn:wsrm:Ping</wsa:Action>
      <wsa:From soapenv:mustUnderstand="1">
         <Address xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</Address>
      </wsa:From>
      <wsa:FaultTo soapenv:mustUnderstand="1">
         <Address xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</Address>
      </wsa:FaultTo>
   </soapenv:Header>
   <soapenv:Body>
      <ns1:Ping soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="urn:wsrm:Ping">
         <arg1 xsi:type="xsd:string">Ping Message Number One</arg1>
      </ns1:Ping>
   </soapenv:Body></soapenv:Envelope>